; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v3 - type_1 ?v4 - type_3)
 	      (pred_4 ?v7 - object ?v4 - type_3)
	      (pred_1 ?v3 - type_1 ?v5 - type_2)
	      (pred_3 ?v3 - type_1 ?v7 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v3 - type_1 ?v6 ?v1 - type_3)
       :precondition (and  (pred_2 ?v3 ?v6))
       :effect (and  (pred_2 ?v3 ?v1)
		     (not (pred_2 ?v3 ?v6))))

   (:action op_3
       :parameters (?v3 - type_1 ?v8 - object ?v2 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v2) (pred_2 ?v3 ?v2) (pred_1 ?v3 ?v5))
       :effect (and (pred_3 ?v3 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v2)) 
		    (not (pred_1 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_1 ?v8 - object ?v2 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v8 ?v5) (pred_2 ?v3 ?v2))
       :effect (and (pred_4 ?v8 ?v2)
		    (pred_1 ?v3 ?v5)
		    (not (pred_3 ?v3 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_09 - type_1
obj_05 obj_08 obj_11 obj_02 - type_2
obj_10 obj_07 obj_03 obj_06 - type_3
obj_12 obj_01 obj_13 - object)
(:init
(pred_2 obj_04 obj_07)
(pred_1 obj_04 obj_05)
(pred_1 obj_04 obj_08)
(pred_2 obj_09 obj_10)
(pred_1 obj_09 obj_11)
(pred_1 obj_09 obj_02)
(pred_4 obj_12 obj_03)
(pred_4 obj_01 obj_06)
(pred_4 obj_13 obj_10)
)
(:goal
(and
(pred_4 obj_12 obj_06)
(pred_4 obj_01 obj_06)
(pred_4 obj_13 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_04 obj_06) (pred_2 obj_09 obj_06))))
  )
)
)

; plan
1. (op_1 obj_04 obj_07 obj_10)
   deleted: (pred_2 obj_04 obj_07)
   added: (pred_2 obj_04 obj_10)
   goals met: 2 of 3
2. (op_1 obj_09 obj_10 obj_03)
   deleted: (pred_2 obj_09 obj_10)
   added: (pred_2 obj_09 obj_03)
   goals met: 2 of 3
3. (op_3 obj_09 obj_12 obj_03 obj_02)
   deleted: (pred_4 obj_12 obj_03) (pred_1 obj_09 obj_02)
   added: (pred_3 obj_09 obj_12 obj_02)
   goals met: 2 of 3
4. (op_1 obj_09 obj_03 obj_06)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_06)
   goals met: 2 of 3
5. (op_2 obj_09 obj_12 obj_06 obj_02)
   deleted: (pred_3 obj_09 obj_12 obj_02)
   added: (pred_4 obj_12 obj_06) (pred_1 obj_09 obj_02)
   goals met: 3 of 3
